src/Catalogs/ОбъектыМетаданных/ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданных</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноИзменениеВРабочихБазах</name>
    <comment>Дополнительный фильтр для отчета &quot;Контроль записи рабочих данных&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ИсторияИменОбъектовМетаданных/ИсторияИменОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИменОбъектовМетаданных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ОбъектыМетаданных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДатаИзменения = ТекущаяДата();
	
	ПредыдущееНаименование = ?(ЭтоНовый(), "", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование"));
	ДополнительныеСвойства.Вставить("ПредыдущееНаименование", ПредыдущееНаименование);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ДополнительныеСвойства.ПредыдущееНаименование = Наименование Тогда
		Набор = РегистрыСведений.ИсторияИменОбъектовМетаданных.СоздатьНаборЗаписей();
		Запись = Набор.Добавить();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.ОбъектМетаданных = Ссылка;
		Запись.Наименование = Наименование;
		Набор.Записать(Ложь);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
